---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeTotalDepth
source: html/d765a67c-3237-3be1-8eeb-c9d19080ae67.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRuntypeTotalDepth Property

"Total Depth": Total Depth

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRuntypeTotalDepth { get; }
```